OpenFOAM-v2412/modules/OpenQBMM/tutorials/buoyantPbePimpleFoam/TaylorCouette/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|e|k|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }

    "moment.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1.0e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 20;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell    0;
    pRefValue   1.0e5;
    turbOnFinalIterOnly no;

    outerCorrectorResidualControl
    {
        p_rgh
        {
            tolerance   1e-4;
            relTol      0.001;
        }

        h
        {
            tolerance   1e-3;
            relTol      0.01;
        }

        T
        {
            tolerance   1e-3;
            relTol      0.01;
        }

        "(k|epsilon|R.*)"
        {
            tolerance   1e-4;
            relTol      0.01;
        }
    }
}

relaxationFactors
{
    equations
    {
        U               0.9;
        k               0.7;
        epsilon         0.7;
        R               0.7;
    }
}


// ************************************************************************* //
